[
  {
    "version": "0.1.9",
    "date": "2025-02-10",
    "changes": {
      "minor": [
        "Set default column width to 100px for better consistency.",
        "Changed column width from string ('px') to number while maintaining the same behavior.",
        "Implemented a sticky header to keep column titles visible while scrolling.",
        "Enhanced column rendering to support both numbers and custom render functions.",
        "Updated tooltip behavior to accept only string and number values for clarity.",
        "Changed default 'multiColumnSort' value to false to prevent unintended multi-column sorting."
      ]
    },
    "added": {
      "major": [
        "Added horizontal scrolling to handle cases with many columns efficiently.",
        "Introduced 'rowPerPage' prop to allow customization of the number of rows displayed per page."
      ]
    }
  },
  {
    "version": "0.1.9",
    "date": "2025-02-10",
    "changes": {
      "minor": [
        "Minified CSS for improved performance.",
        "Updated documentation to reflect the latest changes."
      ]
    }
  },
  {
    "version": "0.1.7",
    "date": "2025-02-08",
    "changes": {
      "minor": [
        "Refactored classname naming conventions for better consistency and readability across components.",
        "Updated documentation to reflect the latest changes, including improved descriptions and usage examples."
      ]
    }
  },
  {
    "version": "0.1.6",
    "date": "2025-02-07",
    "changes": {
      "minor": [
        "Fixed various bugs to improve stability and performance",
        "Enhanced CSS styling for better UI consistency and responsiveness",
        "Updated website documentation with clearer instructions and new details",
        "Refined and expanded the README to provide more comprehensive guidance"
      ]
    }
  },
  {
    "version": "0.1.5",
    "date": "2025-02-05",
    "changes": {
      "minor": [
        "Removed Google Fonts import from CSS files, allowing projects to use their own fonts.",
        "Added `classnames` in the table component for better theme management.",
        "Updated CSS file paths from `theme/*.css` to `theme/rgx-theme/*.css`, grouping all theme-related styles under `theme/rgx-theme/*.css`."
      ]
    },
    "added": {
      "minor": [
        "Added `style` prop support in `loader`, `tooltip`, and `popover` components for inline custom styling.",
        "Introduced `loaderStyle`, `popupStyle`, and `tooltipStyle` props in the table component for easier customization."
      ]
    }
  },
  {
    "version": "0.1.4",
    "date": "2025-02-04",
    "changes": {
      "minor": ["Added column `width` support with width: '100px'."],
      "major": ["Allowed users to `sort` by `multiple columns`."]
    },
    "added": {
      "major": [
        "Added Row Selection feature with individual and all-row selection using the `selectionCheckbox` prop set to `true`.",
        "Added `onSelectionCheck` callback to capture selection events.",
        "Added a popup menu to each column header when sorting is enabled with options to sort ascending, sort descending, or clear sorting."
      ]
    }
  },
  {
    "version": "0.1.3",
    "date": "2025-02-02",
    "changes": {
      "minor": [
        "Renamed `serverSide` to `serverSidePagination` in `ReactGridXProps`.",
        "Set default value of `serverSideSorting` to `false`."
      ]
    },
    "added": {
      "major": [
        "Added `loading` prop to indicate the loading state of the table.",
        "Added `loaderComponent` to display a custom loader when the table is in a loading state. If not provided, the default loader will be used."
      ]
    }
  },
  {
    "version": "0.1.2",
    "date": "2025-02-01",
    "added": {
      "major": [
        "Customizable columns: Define columns with dynamic rendering of data using custom render functions.",
        "Sorting support: Supports sorting by column, including both numerical and alphabetical sorting.",
        "Server-side sorting: Optionally support server-side sorting for large datasets.",
        "Pagination support: Choose from different pagination types (rgx-table-pagination or rgx-arrow-pagination) with configurable rows per page and pagination controls.",
        "Customizable styling: Apply custom themes and styles to the table and pagination components.",
        "Server-side pagination: Optionally support server-side pagination for large datasets.",
        "Tooltip support: Enable tooltips for column headers with customizable content for better user guidance.",
        "Row click event: Capture row clicks using the `onRowClick` callback to handle user interactions.",
        "Expandable rows: Expand rows with a customizable `expandedComponent` to show additional details or content within the same row."
      ]
    }
  }
]
